## Libraries

In [3]:
import pandas as pd
import numpy as np

# EDA

In [5]:
import chardet

# Open the file in binary mode
with open('spam.csv', 'rb') as f:
    result = chardet.detect(f.read(10000))  # Read first 10,000 bytes

print(result)

{'encoding': 'Windows-1252', 'confidence': 0.7261670208776098, 'language': ''}

In [6]:
df = pd.read_csv('spam.csv',encoding=result['encoding'])

In [7]:
df.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [8]:
df.tail()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
5567,spam,This is the 2nd time we have tried 2 contact u...,NaN,NaN,NaN
5568,ham,Will Ì_ b going to esplanade fr home?,NaN,NaN,NaN
5569,ham,"Pity, * was in mood for that. So...any other s...",NaN,NaN,NaN
5570,ham,The guy did some bitching but I acted like i'd...,NaN,NaN,NaN
5571,ham,Rofl. Its true to its name,NaN,NaN,NaN

In [11]:
df.shape

(5572, 5)

## Steps involved in this project
# 1.data cleaning
# 2.EDA
# 3.text processing
# 4. model building
# 5.evolution
# 6. imporvment
# 7. website
# 8. deployment

# data cleaning

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [14]:
# drop last 3 cols
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True)

In [15]:
df.sample(5)

       v1                                                 v2
4023  ham                             Wat time Ì_ wan today?
4996  ham                       Esplanade lor. Where else...
583   ham  my ex-wife was not able to have kids. Do you w...
4637  ham  Captain vijaykanth is doing comedy in captain ...
3248  ham                   Sorry, I can't help you on this.

In [16]:
df.head()

     v1                                                 v2
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [19]:
df.rename(columns={'v1':'target','v2':'text'},inplace = True)

In [20]:
df.sample(5)

     target                                               text
3641    ham  My house here e sky quite dark liao... If rain...
3008   spam  Update_Now - 12Mths Half Price Orange line ren...
4971    ham         I'm fine. Hope you are good. Do take care.
2159   spam  FREE for 1st week! No1 Nokia tone 4 ur mob eve...
5459    ham  If you hear a loud scream in about &lt;#&gt; m...

In [21]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [22]:
df['target'] = encoder.fit_transform(df['target'])

In [23]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [25]:
#check for the missing values
df.isnull().sum()

target    0
text      0
dtype: int64

In [27]:
#check for the duplicate values
df.duplicated().sum()

403

In [28]:
# remove duplicates
df = df.drop_duplicates(keep='first')

In [29]:
df.duplicated().sum()

0

In [30]:
df.shape

(5169, 2)